## Introduction to Pandas library by Mohammad_Kahkeshani
### you con reach this file  in my github:
### https://github.com/mkahkeshani/ML_Course

In [26]:
import pandas as pd
import numpy as np

## Haw to create a Series

In [27]:
a = pd.Series() # take o look at S
a

Series([], dtype: object)

In [51]:
data = np.array(['a', 'b','c','d','e','f'])
b = pd.Series(data)
b

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

### how to change indexes?

In [29]:
b.index

RangeIndex(start=0, stop=6, step=1)

In [52]:
b.index = ['R1', 'R2', 'R3', 'R4','R5', 'R6']
b

R1    a
R2    b
R3    c
R4    d
R5    e
R6    f
dtype: object

In [31]:
b[2]

'c'

In [32]:
b['R4']

'd'

### Creating Series using dictionary

In [33]:
d = pd.Series({'s1': 'Zohreh', 's2': 'Ali', 's3': 'Babak', 's4':'Sepehr'})
d

s1    Zohreh
s2       Ali
s3     Babak
s4    Sepehr
dtype: object

In [34]:
d[0]

'Zohreh'

In [35]:
d.values # show all values

array(['Zohreh', 'Ali', 'Babak', 'Sepehr'], dtype=object)

### Read info

In [36]:
e = pd.Series(range(0,500,1))
e

0        0
1        1
2        2
3        3
4        4
      ...
495    495
496    496
497    497
498    498
499    499
Length: 500, dtype: int64

In [53]:
e.head(7) # By default, it displays the first 5 lines but we can change it

0    0
1    1
2    2
3    3
4    4
5    5
6    6
dtype: int64

In [54]:
e.tail(3) # By default, it displays the last 5 lines but we can change it

497    497
498    498
499    499
dtype: int64

## Read CSV file

In [39]:
pk = pd.read_csv('pokemon.csv') # We can read different types of files
pk

         Pokemon            Type
0      Bulbasaur  Grass / Poison
1        Ivysaur  Grass / Poison
2       Venusaur  Grass / Poison
3     Charmander            Fire
4     Charmeleon            Fire
..           ...             ...
804    Stakataka    Rock / Steel
805  Blacephalon    Fire / Ghost
806      Zeraora        Electric
807       Meltan           Steel
808     Melmetal           Steel

[809 rows x 2 columns]

## Data frame

In [40]:
df = pd.DataFrame()

In [41]:
nba = pd.read_csv('nba.csv')
nba

               Name                 Team Position  Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG   9/26/96   1445697
1    Christian Wood      Detroit Pistons       PF   9/27/95   1645357
2     PJ Washington    Charlotte Hornets       PF   8/23/98   3831840
3      Derrick Rose      Detroit Pistons       PG   10/4/88   7317074
4     Marial Shayok   Philadelphia 76ers        G   7/26/95     79568
..              ...                  ...      ...       ...       ...
445   Austin Rivers      Houston Rockets       PG    8/1/92   2174310
446     Harry Giles     Sacramento Kings       PF   4/22/98   2578800
447     Robin Lopez      Milwaukee Bucks        C    4/1/88   4767000
448   Collin Sexton  Cleveland Cavaliers       PG    1/4/99   4764960
449     Ricky Rubio         Phoenix Suns       PG  10/21/90  16200000

[450 rows x 5 columns]

In [42]:
nba.columns

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [43]:
nba.shape

(450, 5)

In [44]:
nba.size # Count All

2250

### NAN is abbreviation of: not a number

In [45]:
nba.count() # If we have NAN value, it will not be counted

Name        450
Team        450
Position    450
Birthday    450
Salary      450
dtype: int64

In [46]:
nba.nunique() # show unique vals

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [47]:
nba.nlargest(2,'Salary') # get max val for each column

              Name                   Team Position Birthday    Salary
205  Stephen Curry  Golden State Warriors       PG  3/14/88  40231758
38      Chris Paul  Oklahoma City Thunder       PG   5/6/85  38506482

In [48]:
nba.sum(numeric_only= True) # sum all ints

Salary    3444112694
dtype: int64

In [55]:
nba.sort_values(by= 'Name', ascending= False) # if ascenfing false ???

                  Name                   Team Position  Birthday    Salary
248     Zylan Cheatham   New Orleans Pelicans       SF  11/17/95     79568
137    Zion Williamson   New Orleans Pelicans        F    7/6/00   9757440
312       Zhaire Smith     Philadelphia 76ers       SG    6/4/99   3058800
302       Zach Norvell     Los Angeles Lakers       SG   12/9/97     79568
159        Zach LaVine          Chicago Bulls       PG   3/10/95  19500000
..                 ...                    ...      ...       ...       ...
399  Admiral Schofield     Washington Wizards       SF   3/30/97   1000000
81         Adam Mokoka          Chicago Bulls        G   7/18/98     79568
437        Abdel Nader  Oklahoma City Thunder       SF   9/25/93   1618520
101      Aaron Holiday         Indiana Pacers       PG   9/30/96   2239200
52        Aaron Gordon          Orlando Magic       PF   9/16/95  19863636

[450 rows x 5 columns]

In [50]:
nba.sort_values(by= ['Position','Salary'])

                Name                    Team Position  Birthday    Salary
370          Bol Bol          Denver Nuggets        C  11/16/99     79568
395       Tacko Fall          Boston Celtics        C  12/10/95     79568
126  Dewan Hernandez         Toronto Raptors        C   12/9/96    898310
207   Daniel Gafford           Chicago Bulls        C   10/1/98    898310
438   Bruno Fernando           Atlanta Hawks        C   8/15/98   1400000
..               ...                     ...      ...       ...       ...
167     Allen Crabbe           Atlanta Hawks       SG    4/9/92  18500000
35      Bradley Beal      Washington Wizards       SG   6/28/93  27093018
117     Devin Booker            Phoenix Suns       SG  10/30/96  27285000
154      CJ McCollum  Portland Trail Blazers       SG   9/19/91  27556959
214    Klay Thompson   Golden State Warriors       SG    2/8/90  32742000

[450 rows x 5 columns]